Revit 2026 API

# BuiltInFailuresIlluminationFailures Class

---

Failures about Illumination.

SystemObject Autodesk.Revit.DBBuiltInFailuresIlluminationFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class IlluminationFailures
```
```vb
Public NotInheritable Class IlluminationFailures
```
```cpp
public ref class IlluminationFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type IlluminationFailures = class end
```

The BuiltInFailuresIlluminationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IESFileNotFoundWarning | Estimated Illumination failed. IES file not found for lighting fixture. |
|  | LightingFixtureLumensWarning | Estimated Illumination failed. Lumens not set for lighting fixture. |
|  | RoomCoefficientUtilizationWarning | Estimated Illumination failed. Coefficient of utilization not set for lighting fixture. |
|  | RoomLightLossFactorWarning | Estimated Illumination failed. Light Loss factor not set for lighting fixture. |

#### Reference

Autodesk.Revit.DB Namespace